In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['test.csv', 'train.csv', 'gender_submission.csv']

In [2]:
gender_df = pd.read_csv("../input/gender_submission.csv")

In [3]:
gender_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [4]:
titanic_train_df = pd.read_csv("../input/train.csv")
titanic_train_df.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
titanic_train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
titanic_train_df.describe()

       PassengerId    Survived     ...           Parch        Fare
count   891.000000  891.000000     ...      891.000000  891.000000
mean    446.000000    0.383838     ...        0.381594   32.204208
std     257.353842    0.486592     ...        0.806057   49.693429
min       1.000000    0.000000     ...        0.000000    0.000000
25%     223.500000    0.000000     ...        0.000000    7.910400
50%     446.000000    0.000000     ...        0.000000   14.454200
75%     668.500000    1.000000     ...        0.000000   31.000000
max     891.000000    1.000000     ...        6.000000  512.329200

[8 rows x 7 columns]

In [7]:
titanic_train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [8]:
titanic_train_df.isnull().sum(axis=0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
titanic_train_df.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [10]:
titanic_train_df['Age'].nunique() 
titanic_train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
#titanic_train_model = titanic_train_df.drop(columns = ['Survived','PassengerId','Name','Cabin','Ticket'])
titanic_train_model = titanic_train_df.drop(columns = ['PassengerId','Name','Cabin','Ticket'])

In [12]:
titanic_train_model.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [13]:
titanic_train_model['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [14]:
titanic_train_model['Age'].fillna(value= titanic_train_model['Age'].mean(), inplace= True)
titanic_train_model.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [15]:
# I replaced the two null values in Embarked with the maximum number of occurances which was S
titanic_train_model = titanic_train_model.fillna({"Embarked": "S"})
titanic_train_model["Embarked"].value_counts()
#titanic_train_model['Embarked'].fillna(value= titanic_train_model['Age'].mean())

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [16]:
#titanic_train_model.head()
titanic_train_model = pd.get_dummies(titanic_train_model, columns=['Sex'])
titanic_train_model.head()
titanic_train_model = pd.get_dummies(titanic_train_model, columns=['Embarked'])

In [17]:
titanic_train_model.columns

Index(['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_female',
       'Sex_male', 'Embarked_C', 'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [18]:
input_var = [col for col in titanic_train_model.columns if titanic_train_model[col].dtype != 'object']

In [19]:
input_var

['Survived',
 'Pclass',
 'Age',
 'SibSp',
 'Parch',
 'Fare',
 'Sex_female',
 'Sex_male',
 'Embarked_C',
 'Embarked_Q',
 'Embarked_S']

In [20]:
output_var = 'Survived'
input_var.remove(output_var)

In [21]:
input_var

['Pclass',
 'Age',
 'SibSp',
 'Parch',
 'Fare',
 'Sex_female',
 'Sex_male',
 'Embarked_C',
 'Embarked_Q',
 'Embarked_S']

In [22]:
from sklearn.model_selection import train_test_split

In [23]:
x_train, x_val, y_train, y_val = train_test_split(titanic_train_model[input_var], titanic_train_model[output_var], test_size = 0.25)

In [24]:
from sklearn.tree import DecisionTreeClassifier

In [25]:
dt1 = DecisionTreeClassifier()

In [26]:
dt1.fit(X=x_train[input_var], y=y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [27]:
from sklearn.metrics import accuracy_score

In [28]:
print(accuracy_score(y_pred=dt1.predict(x_train[input_var]), y_true=y_train))
print(accuracy_score(y_pred=dt1.predict(x_val[input_var]), y_true=y_val))

0.9835329341317365
0.7847533632286996

In [29]:
# Random Forest
from sklearn.ensemble import RandomForestClassifier

In [30]:
rf1 = RandomForestClassifier(n_estimators=100)

In [31]:
rf1.fit(X=x_train[input_var], y=y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=None,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [32]:
print(accuracy_score(y_pred=rf1.predict(X=x_train[input_var]), y_true=y_train))
print(accuracy_score(y_pred=rf1.predict(X=x_val[input_var]), y_true=y_val))

0.9835329341317365
0.7892376681614349